/**
 * 이메일 주소 정규식
 *  - 맨앞에 숫자가 나올 수 없음.
 */
export const EMAIL_REGEXP =
  /^[0-9a-zA-Z]([-_.]?[0-9a-zA-Z])*@[0-9a-zA-Z]([-_.]?[0-9a-zA-Z])*.[a-zA-Z]{2,3}$/i;

/**
 * 핸드폰번호 정규식
 */
export const MOBILE_PHONE_REGEXP = /^\d{3}-\d{3,4}-\d{4}$/;

/**
 * 비밀번호 정규식
 * - 최소 8자, 최대 15자
 * - 대문자 1개 이상
 * - 소문자 1개 이상
 * - 숫자 1개 이상
 * - 특수문자 1개 이상
 */
export const PASSWORD_REGEXP =
  /^(?=.*[a-z])(?=.*[A-Z])(?=.*\d)(?=.*[$@$!%*?&])[a-zA-Z\d$@$!%*?&]{8,15}$/;

/**
 * 주문마감일 날짜 정규식
 * - 형식: YYYY-mm-dd
 * - 예시: 2022-12-25
 */
export const DATE_REGEX = /([12]\d{3}-(0[1-9]|1[0-2])-(0[1-9]|[12]\d|3[01]))/;
